In [1]:
import pandas as pd
import numpy as np

## Get metadata about hotel

In [5]:
df = pd.read_csv('../../data/item_metadata.csv')
df.head()

   item_id                                         properties
0     5101  Satellite TV|Golf Course|Airport Shuttle|Cosme...
1     5416  Satellite TV|Cosmetic Mirror|Safe (Hotel)|Tele...
2     5834  Satellite TV|Cosmetic Mirror|Safe (Hotel)|Tele...
3     5910  Satellite TV|Sailing|Cosmetic Mirror|Telephone...
4     6066  Satellite TV|Sailing|Diving|Cosmetic Mirror|Sa...

In [20]:
df['properties'] = df['properties'].str.replace(' ', '_')

In [21]:
df.head()

   item_id                                         properties
0     5101  Satellite_TV|Golf_Course|Airport_Shuttle|Cosme...
1     5416  Satellite_TV|Cosmetic_Mirror|Safe_(Hotel)|Tele...
2     5834  Satellite_TV|Cosmetic_Mirror|Safe_(Hotel)|Tele...
3     5910  Satellite_TV|Sailing|Cosmetic_Mirror|Telephone...
4     6066  Satellite_TV|Sailing|Diving|Cosmetic_Mirror|Sa...

In [22]:
df2 = df.assign(properties=df['properties'].str.split('|'))#.explode('properties')
df2 = df2.reset_index(drop=True)
df2['properties'] = df2['properties'].apply(lambda li: ' '.join(li))

In [23]:
df2.head()

   item_id                                         properties
0     5101  Satellite_TV Golf_Course Airport_Shuttle Cosme...
1     5416  Satellite_TV Cosmetic_Mirror Safe_(Hotel) Tele...
2     5834  Satellite_TV Cosmetic_Mirror Safe_(Hotel) Tele...
3     5910  Satellite_TV Sailing Cosmetic_Mirror Telephone...
4     6066  Satellite_TV Sailing Diving Cosmetic_Mirror Sa...

In [24]:
# df2['properties'].unique()

In [25]:
# df3 = pd.get_dummies(df2, 'properties')

In [26]:
# c = list(df3.columns)
# c.remove('item_id')

In [27]:
# df3.groupby('item_id')[c].sum(axis=0)
# # df3.head()

In [28]:
from sklearn.feature_extraction.text import CountVectorizer

In [29]:
vectorizer = CountVectorizer(binary=True, max_features=50, dtype=np.int8, tokenizer=lambda x: x.split(' '), lowercase=False)

In [30]:
result = vectorizer.fit_transform(df2['properties'].values)

In [31]:
new_col_names = vectorizer.get_feature_names()

In [32]:
final_df = pd.DataFrame(result.toarray(), columns=new_col_names)
final_df['item_id'] = df2['item_id']

In [33]:
final_df.head()

,Air_Conditioning,Bathtub,Beach,Business_Hotel,Cable_TV,Car_Park,Central_Heating,Computer_with_Internet,Conference_Rooms,Cot,...,Shower,Sitting_Area_(Rooms),Telephone,Television,Terrace_(Hotel),Very_Good_Rating,Washing_Machine,WiFi_(Public_Areas),WiFi_(Rooms),item_id
0,1,1,0,1,1,1,1,1,1,1,...,1,1,1,1,1,0,0,1,1,5101
1,0,1,0,1,0,1,0,1,1,1,...,1,1,1,1,1,1,0,1,1,5416
2,0,0,1,1,0,1,1,1,0,1,...,1,0,1,0,1,1,0,1,1,5834
3,0,1,0,1,1,1,1,1,1,0,...,1,0,1,1,1,0,0,1,0,5910
4,0,1,1,1,1,1,1,1,1,1,...,1,1,1,1,1,0,0,1,1,6066

In [34]:
final_df.to_csv('../../data/final_df.csv', index=False)